# Getting Started with pandas

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

## Introduction to pandas Data Structures

### Series

let's create a toy series

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

we can see the values of the series using .values
and the index of the series using .index

In [5]:
obj.values
#obj.index  # like range(4)

array([ 4,  7, -5,  3], dtype=int64)

we can specify an index list

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2
#obj2.index

d    4
b    7
a   -5
c    3
dtype: int64

we use indexs to fetch data from the row, or assign values to the series, or slice into the series and get certain rows

In [7]:
obj2['a']
#obj2['d'] = 6
#obj2[['c', 'a', 'd']]

-5

we can use different logical/mathematical operations

these operations are vectorized which allows for complex operations in low time thorugh all the values

In [8]:
obj2[obj2 > 0] # to get a series of booleans representing the condition
#obj2 * 2 # to multiply each number in the series by 2
#np.exp(obj2) # to apply any mathematical funtion to all the values at once

d    4
b    7
c    3
dtype: int64

to get a single true of false depending on the presense of value inside a series

In [9]:
'b' in obj2
#'e' in obj2

True

we can create series from dictionaries with index = keys

In [10]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

or just pass in the index as list of values

In [11]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

to see if there are null values or na values, which are indication for missing values

In [12]:
pd.isnull(obj4)
#pd.notnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

we can also use the .isnull() method implemented into pandas.Series class

In [13]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

let's see what happens when we add 2 series with different indexes values

In [14]:
obj3
#obj4
#obj3 + obj4

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

we can give a name to our series and to our index

In [15]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

we can also set the index at any time by specifying it

In [16]:
obj
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

we can create a df using dictionary with the keys now as the col names

In [17]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [18]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

we can use .head() on any dataframe to visualize the first 5 rows

In [19]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

as with Series, we can set the columns as a list of values

In [20]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

and the same thing with the index

and we can see the columns of a dataframe using the .columns property

In [21]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2
#frame2.columns

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

we can access the col by passing it like this, or with propper writing we can access it like that

In [22]:
frame2['state']
#frame2.year

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

we can also use locate method by passing the index name then the column name, or we can access the entire row by passing only the index

In [23]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

we can set values directly for a col or row by setting it's value like this

In [24]:
frame2['debt'] = 16.5
frame2
# frame2['debt'] = np.arange(6.)
# frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

as we know the dataframes consists of series, we can set a new col as a series

but what happen when the indexes mismatch?

In [25]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

we can also use the same logical operations notations here, by getting back a series of True or False, AND THIS IS IMPORTANT

In [26]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

we can remove columns by using pythons del, or using pd.drop but we will discuss it later

In [27]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

again let's see if we create data with mismatched indexes

In [28]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [29]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

we can transpose our dataframe using .T property

In [30]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

let's see what happens when we specify a new index that has no record

In [31]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [32]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

we can set a name to the index and the same to the cols to make it more informative

In [33]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

we can access the values in list of lists fashion, and we can see the type of the data is array not pandas series nor dataframe

In [34]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [35]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

we can treat index like lists, we can simply slice through it

In [36]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index
#index[1:]

Index(['a', 'b', 'c'], dtype='object')

we can't change index object values

index[1] = 'd'  # TypeError

we can create an Index instance using pd.Index class

In [37]:
labels = pd.Index(np.arange(3))
labels
# obj2 = pd.Series([1.5, -2.5, 0], index=labels)
# obj2
## we can also see if our index matches certain list of values
# obj2.index is labels

Int64Index([0, 1, 2], dtype='int64')

we can check to see if certain value happens to be in our index or columns

In [38]:
frame3
# frame3.columns
# 'Ohio' in frame3.columns
# 2003 in frame3.index

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

there can be multible duplications of an index, it's fine

In [39]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## We can have questions for now if anyone has

## Essential Functionality

### Reindexing

toy series

In [40]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

we can reindex our data series or dataframe by passing our new order for the index as we please

and when a new index is not in the original data it will be filled with nans

In [41]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

one way to solve the nans is using filling methods, more about that later, here we use forward filling method

In [42]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3
#obj3.reindex(range(6), method='ffill')

0      blue
2    purple
4    yellow
dtype: object

In [43]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame
# frame2 = frame.reindex(['a', 'b', 'c', 'd'])
# frame2

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

we can also reindex using columns to sort them as we want

In [44]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

if we used locating with an index that is not present we will get an error

`frame.loc[['a', 'b', 'c', 'd'], states] `==> `KeyError: "['b'] not in index"`

here we can drop certain col or rows using the index or the col name

### Dropping Entries from an Axis

In [45]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj
# new_obj = obj.drop('c')
# new_obj
# obj.drop(['d', 'c'])

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [46]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [47]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

we can either specify the axis type or number

In [48]:
data.drop('two', axis=1)
#data.drop(['two', 'four'], axis='columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

we can use inplace = True to change the actual dataframe

In [49]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and Filtering

we can use different types of indexing for Series as well as for DataFrames

here we can slice the data and acquire what we want using simple logical/mathematical operations

In [50]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj
# obj['b']
# obj[1]
# obj[2:4]
# obj[['b', 'a', 'd']]
# obj[[1, 3]]
# obj[obj < 2]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [51]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

we can set values for certain rows or cols to a specified values

In [52]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [53]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data
# data['two']
# data[['three', 'one']]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [54]:
data[:2]
#data[data['three'] > 5]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [55]:
data < 5
# data[data < 5] = 0
# data

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

#### Selection with loc and iloc

as we said loc and iloc takes the rows and then cols for Dataframes to get back the values in those cells 

we can use names/strings with loc for `.loc[ row_name , col_name ]`

or we can use int values with iloc like `.iloc[ row_num , col_num]`

In [56]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [57]:
data.iloc[2, [3, 0, 1]]
# data.iloc[2]
# data.iloc[[1, 2], [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

we can also slice using loc and iloc using logical/mathematical operations

In [58]:
data.loc[:'Utah', 'two']
# data.iloc[:, :3][data.three > 5]

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

### Integer Indexes

In [59]:
ser = pd.Series(np.arange(3.))

In [60]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

we can get the last value of the series by going through it like a list

In [61]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [62]:
ser[:1]
# ser.loc[:1]
# ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [63]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
display( s1 )
s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

again adding 2 series with different indexes, but look at the order of the indexs, it's the same as the left series, and will always inherit it's rows

In [64]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [65]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
display( df1 )
df2

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

the same with dataframes

In [66]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

here we can see that sum or sub both depends on the col and index

In [67]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
display( df1 )
df2
#df1 - df2

   A
0  1
1  2

   B
0  3
1  4

#### Arithmetic methods with fill values

In [68]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
display( df1 )
df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [69]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

to fix the nan values when sub or adding we can use pandas methods

In [70]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

the save with dividing

In [71]:
1 / df1 == df1.rdiv(1)

      a     b     c     d
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True

we can reindex using other columns from another df

In [72]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

values in the shape of list of lists

In [73]:
arr = np.arange(12.).reshape((3, 4)) 
arr
# arr[0]
# arr - arr[0]

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [74]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
display(frame)
series

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

we can subtract a frame from series row wise

In [75]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

if the inedx mismatch, then we sum only on those which matches

note that when nan + number is still nan that's why d is nan

In [76]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

we can specify the axis we want to make operation on using df methods

In [77]:
series3 = frame['d']
display(frame)
series3
# frame.sub(series3, axis='index')

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

## We can take questions

### Function Application and Mapping

we can use lot's of numpy mathematical functions to apply it to our dataframe or series in fast and effitient way

In [78]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
display( frame )
np.abs(frame)

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

Or we can use:

apply() is used to apply a function along an axis of the DataFrame or on values of Series. 

applymap() is used to apply a function to a DataFrame elementwise. 

map() is used to substitute each value in a Series with another value.

In [79]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

and we can specify the axis it performs on

In [80]:
frame.apply(f, axis='columns')

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [81]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [82]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [83]:
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and Ranking

we can sort our index for series or dataframe

In [84]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

and we can also change the axis

In [85]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
display(frame)
display( frame.sort_index() )
frame.sort_index(axis=1)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

and we can specify the ascending order

In [86]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

and we can sort the values for a specific series

In [87]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [88]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

we can specify the col we want to sort our dataframe by and then use it to sort the whole dataframe

In [89]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
display( frame )
frame.sort_values(by='b')

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

or you can specify multi columns and sort by the first then sec

In [90]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### Axis Indexes with Duplicate Labels

In [91]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

we can check duplication using is_unique property

In [92]:
obj.index.is_unique

False

In [93]:
display(obj['a'] )
obj['c']

a    0
a    1
dtype: int64

4

In [94]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
display( df )
df.loc['b']

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and Computing Descriptive Statistics

In [95]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

we can sum through rows

In [96]:
df.sum()

one    9.25
two   -5.80
dtype: float64

or specify the axis

In [97]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

and we can show the nan in the summing

In [98]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

we can use cumulative sum  which is adding the prev value to the next

In [99]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

or we can use the describe function

In [100]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

note how it differs between numeric values and string values

In [101]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

conda install pandas-datareader

In [102]:
price = pd.read_pickle('examples/yahoo_price.pkl')
volume = pd.read_pickle('examples/yahoo_volume.pkl')

import pandas_datareader.data as web


all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}



price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

                     
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

we can use tail instead of head to display last 5 rows

In [103]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

we can see the correlation or covariance between 2 series in the data

In [104]:
returns['MSFT'].cov(returns['IBM'])

8.870655479703549e-05

In [105]:
returns.MSFT.corr(returns.IBM)

0.4997636114415116

or we can use it on the whole dataframe to show the correlation/covariance between each column

In [106]:
display( returns.corr() )
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

and we can see the correlation between a certain column and the rest using corrwith

In [107]:
returns.corrwith(returns.IBM)

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [108]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

### Unique Values, Value Counts, and Membership

In [109]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [110]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

we can either use pandas function or data method

In [111]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [112]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

we can use that to slice through the data and get only what matches our condition

In [113]:
display( obj )
mask = obj.isin(['b', 'c'])
display( mask )
obj[mask]

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

0    c
5    b
6    b
7    c
8    c
dtype: object

we can use get_inedxer to get where values belong to the index

In [114]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])

pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [115]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

we can use pd functions to apply it on our data

and also use fillna to fill the values for missing data

In [116]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# **The End, Thank you all for your patience**

your feedback is valuable, don't hesitate to share your thoughts on our webpage: [Pie & AI: Alexandria](https://www.facebook.com/Pie.AI.Alexandria)